In [66]:
import pandas as pd
import numpy as np

In [2]:
print(pd.__version__)

2.1.2

In [3]:
arr = [1,2,3,4,5]
s1 = pd.Series(arr)
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
dict1 = {'a': 4, 'b':5, 'c': 7}
s2 = pd.Series(dict1)
s2

a    4
b    5
c    7
dtype: int64

In [5]:
# Creating a dataframe

data = {'name': ['Asif', 'pervej', 'Naharul', "Asad", 'Rakib', 'Asifa'],
        'Age': [25, 40, 34, 20, 75, 28],
        'Sex': ['male', 'male', 'male', 'male', 'male', 'female']
        }

In [6]:
data

{'name': ['Asif', 'pervej', 'Naharul', 'Asad', 'Rakib', 'Asifa'],
 'Age': [25, 40, 34, 20, 75, 28],
 'Sex': ['male', 'male', 'male', 'male', 'male', 'female']}

In [7]:
df = pd.DataFrame(data)

In [8]:
df

      name  Age     Sex
0     Asif   25    male
1   pervej   40    male
2  Naharul   34    male
3     Asad   20    male
4    Rakib   75    male
5    Asifa   28  female

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   Age     6 non-null      int64
 2   Sex     6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [10]:
df.isnull()

    name    Age    Sex
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False

In [11]:
df.isnull().sum()

name    0
Age     0
Sex     0
dtype: int64

In [12]:
df.describe()

             Age
count   6.000000
mean   37.000000
std    19.879638
min    20.000000
25%    25.750000
50%    31.000000
75%    38.500000
max    75.000000

In [13]:
# 1 std = 66.67%
# 2 std = 88.7%
# 3 std = 99.98%

In [14]:
df['Age'].mean()

37.0

In [17]:
(25+40+34+ 20+ 28)/5

29.4

In [19]:
abs(df['Age'] - 37)

0    12
1     3
2     3
3    17
4    38
5     9
Name: Age, dtype: int64

In [20]:
abs(df['Age'] - 30)

0     5
1    10
2     4
3    10
4    45
5     2
Name: Age, dtype: int64

In [21]:
df['Age'].min()

20

In [22]:
df['Age'].max()

75

In [23]:
df['Cum_Age'] = df['Age'].cumsum()

In [24]:
df

      name  Age     Sex  Cum_Age
0     Asif   25    male       25
1   pervej   40    male       65
2  Naharul   34    male       99
3     Asad   20    male      119
4    Rakib   75    male      194
5    Asifa   28  female      222

In [25]:
df.head()

      name  Age   Sex  Cum_Age
0     Asif   25  male       25
1   pervej   40  male       65
2  Naharul   34  male       99
3     Asad   20  male      119
4    Rakib   75  male      194

In [26]:
df.head(3)

      name  Age   Sex  Cum_Age
0     Asif   25  male       25
1   pervej   40  male       65
2  Naharul   34  male       99

In [27]:
df.tail(3)

    name  Age     Sex  Cum_Age
3   Asad   20    male      119
4  Rakib   75    male      194
5  Asifa   28  female      222

In [28]:
df['Age'] >= 30

0    False
1     True
2     True
3    False
4     True
5    False
Name: Age, dtype: bool

In [29]:
df[df['Age'] >= 30]

      name  Age   Sex  Cum_Age
1   pervej   40  male       65
2  Naharul   34  male       99
4    Rakib   75  male      194

In [30]:
df['Sex'].value_counts()

Sex
male      5
female    1
Name: count, dtype: int64

In [32]:
df[df['Sex'] == 'male']

      name  Age   Sex  Cum_Age
0     Asif   25  male       25
1   pervej   40  male       65
2  Naharul   34  male       99
3     Asad   20  male      119
4    Rakib   75  male      194

In [39]:
df[['Age', 'Cum_Age']].corr()

              Age   Cum_Age
Age      1.000000  0.393873
Cum_Age  0.393873  1.000000

In [37]:
df1 = df[['Age', 'Cum_Age']]

In [38]:
df1

   Age  Cum_Age
0   25       25
1   40       65
2   34       99
3   20      119
4   75      194
5   28      222

In [40]:
df1['Dup_Age'] = df1['Age']

/var/folders/gt/vjk4pjkx7vj4rs7tvxf6bd8h0000gn/T/ipykernel_8023/1627984140.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['Dup_Age'] = df1['Age']

In [41]:
df1

   Age  Cum_Age  Dup_Age
0   25       25       25
1   40       65       40
2   34       99       34
3   20      119       20
4   75      194       75
5   28      222       28

In [42]:
df1[['Age', 'Dup_Age']].corr()

         Age  Dup_Age
Age      1.0      1.0
Dup_Age  1.0      1.0

In [43]:
df['Sex'].mode()

0    male
Name: Sex, dtype: object

In [44]:
df['Age'].median()

31.0

In [45]:
df.sort_values(by='Age')

      name  Age     Sex  Cum_Age
3     Asad   20    male      119
0     Asif   25    male       25
5    Asifa   28  female      222
2  Naharul   34    male       99
1   pervej   40    male       65
4    Rakib   75    male      194

In [46]:
df.sort_values(by = 'Age', ascending = False)

      name  Age     Sex  Cum_Age
4    Rakib   75    male      194
1   pervej   40    male       65
2  Naharul   34    male       99
5    Asifa   28  female      222
0     Asif   25    male       25
3     Asad   20    male      119

In [47]:
df

      name  Age     Sex  Cum_Age
0     Asif   25    male       25
1   pervej   40    male       65
2  Naharul   34    male       99
3     Asad   20    male      119
4    Rakib   75    male      194
5    Asifa   28  female      222

In [52]:
df.sort_values(by = 'Age', ascending = False, inplace=True)

In [53]:
df

      name  Age     Sex  Cum_Age
4    Rakib   75    male      194
1   pervej   40    male       65
2  Naharul   34    male       99
5    Asifa   28  female      222
0     Asif   25    male       25
3     Asad   20    male      119

In [56]:
df.reset_index(inplace=True, drop=True)

In [57]:
df

   index     name  Age     Sex  Cum_Age
0      4    Rakib   75    male      194
1      1   pervej   40    male       65
2      2  Naharul   34    male       99
3      5    Asifa   28  female      222
4      0     Asif   25    male       25
5      3     Asad   20    male      119

In [58]:
data = {'name': ['Asif', 'pervej', 'Naharul', "Asad", 'Rakib', 'Asifa'],
        'Age': [25, 40, 34, 20, 75, 28],
        'Sex': ['male', 'male', 'male', 'male', 'male', 'female']
        }
df2 = pd.DataFrame(data)
df2

      name  Age     Sex
0     Asif   25    male
1   pervej   40    male
2  Naharul   34    male
3     Asad   20    male
4    Rakib   75    male
5    Asifa   28  female

In [60]:
df2.sort_values(by= 'Age', ascending=False)

      name  Age     Sex
4    Rakib   75    male
1   pervej   40    male
2  Naharul   34    male
5    Asifa   28  female
0     Asif   25    male
3     Asad   20    male

In [63]:
df2.reset_index(inplace=True, drop=True)

In [64]:
df2

      name  Age     Sex
0     Asif   25    male
1   pervej   40    male
2  Naharul   34    male
3     Asad   20    male
4    Rakib   75    male
5    Asifa   28  female

In [65]:
df.drop('index', axis=1)

      name  Age     Sex  Cum_Age
0    Rakib   75    male      194
1   pervej   40    male       65
2  Naharul   34    male       99
3    Asifa   28  female      222
4     Asif   25    male       25
5     Asad   20    male      119

In [68]:
data = {'name': ['Asif', 'pervej', 'Naharul', np.NaN, "Asad", 'Rakib', 'Asifa'],
        'Age': [25, 40, 34, 20, 75, np.NaN, 28],
        'Sex': ['male', 'male', 'male', 'female',  'male', 'male', 'female']
        }
df3 = pd.DataFrame(data)
df3

      name   Age     Sex
0     Asif  25.0    male
1   pervej  40.0    male
2  Naharul  34.0    male
3      NaN  20.0  female
4     Asad  75.0    male
5    Rakib   NaN    male
6    Asifa  28.0  female

In [69]:
df3.isnull().sum()

name    1
Age     1
Sex     0
dtype: int64

In [70]:
df3.dropna()

      name   Age     Sex
0     Asif  25.0    male
1   pervej  40.0    male
2  Naharul  34.0    male
4     Asad  75.0    male
6    Asifa  28.0  female

In [ ]:
# null value replacing with mean, median, mode
# agg
# group by
# merge
# concat
# pivot